ackage com.interview.test;

/**
 * Created by THINK on 2017/7/3.
 */
public class Test {
    //这是源代码：
    public static void main(String[] args) {
        System.out.println("閔粤在此方法中布置了作业：请各位收到后一一作答。");
        /**
         * 一、问答题（40分）
         * 1.==与equal有何区别？ （汤宇航）
         * 2.java语言里&的&&有何区别？（覃津传）
         * 3.java的char型变量能否存储一个中文汉字？为什么？（毛璇）
         * 4.overload与override的区别？overload的方法 是否可以改变返回值？（覃认追）
         * 5.内存溢出是指的什么？Java会不会内存溢出？ （黄卓燊）
         * 6.JSP中的动态include与静态include的区别是什么？ （应传福）
         * 7.运行时异常与一般异常有何异同？ （舒张）
         * 8.ArrayList与LinkedList的区别？ （黄卓燊）
         * 9.数据库的连接池的作用与工作机制分别是什么？ （梁梦楚）
         * 10.Spring是如何实现IOC的？如何使用AOP机制配置事务？ （黄卓燊）
         *二、数据库（10分）
         *1.（黄卓燊）
         *2.（黄卓燊）
         * 三、编程题：（10分）
         * 1.编写一个函数判读n是否为质数 ？（陈广林）
         * 2.编写一个F(n)，求从小到大的n个质数之和？ （陈超嫦）
         * 3.编写一个程序，统计从键盘中输入的5种字符数？ （张雄英）
         * 四、思考题：（10分）
         * 1.编写一个程序交换a=1,b=2的值，不得使用中间变量；
         * 2.Java是完全面向对象的语言吗？为什么？ （曾翔伟）
         * 五、翻译题 （10分）
         * 六、拓展题
         * 1.说说你对团队的理解？工作中你喜欢和什么样的人合作？不喜欢和什么样的人合作？
         * 2.说说你期望的工作环境与工作氛围？你对你的直接上司有什么期望？
         * 3.说说你的职业规划及实现步骤？
         *
         */
    }


}
